In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from config import conn_string

**read all files**

In [2]:
# path
station_path = os.path.join('.', "station_info.csv")
weather_path = os.path.join('.', "historical_weather.csv")

#bikes
toronto_bikes = os.path.join("Resources/1_toronto_canada", "toronto_bikes.csv")
vancouver_bikes = os.path.join("Resources/2_vancouver_canada", "vancouver_bikes.csv")
boston_bikes = os.path.join("Resources/3_boston_us", "boston_bikes.csv")
nyc_bikes = os.path.join("Resources/4_NewYork_US", "nyc_bikes.csv")

# membertypes
toronto_users = os.path.join("Resources/1_toronto_canada", "toronto_membertypes.csv")
vancouver_users = os.path.join("Resources/2_vancouver_canada", "vancouver_membertypes.csv")
boston_users = os.path.join("Resources/3_boston_us", "boston_membertypes.csv")
nyc_users = os.path.join("Resources/4_NewYork_US", "nyc_membertypes.csv")

# ridership
toronto_ = os.path.join("Resources/1_toronto_canada", "toronto_bikeshare.csv")
vancouver_ = os.path.join("Resources/2_vancouver_canada", "vancouver_bikeshare.csv")
boston_ = os.path.join("Resources/3_boston_us", "boston_bikeshare.csv")
nyc_ = os.path.join("Resources/4_NewYork_US", "nyc_bikeshare.csv")

In [3]:
# read files
stns = pd.read_csv(station_path, encoding="utf-8")
weather = pd.read_csv(weather_path, encoding="utf-8")

# bikes
tor_bikes = pd.read_csv(toronto_bikes, encoding="utf-8")
van_bikes = pd.read_csv(vancouver_bikes, encoding="utf-8")
bos_bikes = pd.read_csv(boston_bikes, encoding="utf-8")
nyc_bikes = pd.read_csv(nyc_bikes, encoding="utf-8")

# member_types
tor_users = pd.read_csv(toronto_users, encoding="utf-8")
van_users = pd.read_csv(vancouver_users, encoding="utf-8")
bos_users = pd.read_csv(boston_users, encoding="utf-8")
nyc_users = pd.read_csv(nyc_users, encoding="utf-8")

# pricing index


# ridership
toronto = pd.read_csv(toronto_, encoding="utf-8")
vancouver = pd.read_csv(vancouver_, encoding="utf-8")
boston = pd.read_csv(boston_, encoding="utf-8")
newyork = pd.read_csv(nyc_, encoding="utf-8")

**Locations**

In [5]:
locations = [{"location_id": 1,"city":"Toronto", "country":"Canada" }, 
             {"location_id": 2,"city":"Vancouver", "country":"Canada"},
             {"location_id": 3,"city":"Boston", "country":"USA"},
             {"location_id": 4,"city":"New York", "country":"USA"}
            ]

df = pd.DataFrame(locations)
df.set_index("location_id", inplace=True)
df

                  city country
location_id
1              Toronto  Canada
2            Vancouver  Canada
3               Boston     USA
4             New York     USA

**Stations**

In [6]:
stns.head()

,station_id,station_name,latitude,longitude,location_id
0,7000,Fort York Blvd / Capreol Ct,43.639832,-79.395954,1
1,7001,Lower Jarvis St / The Esplanade,43.647830,-79.370698,1
2,7002,St. George St / Bloor St W,43.667333,-79.399429,1
3,7003,Madison Ave / Bloor St W,43.667158,-79.402761,1
4,7004,University Ave / Elm St,43.656518,-79.389099,1

**Historical Weather**

In [7]:
weather.head()

,location_id,forecast_date,maxtempc,humidity,total_precip,avg_cloudcover,avg_windspeed
0,1,2019-01-01,1,77.250,3.6,50.625,16.875
1,1,2019-01-02,-5,69.000,0.2,41.750,8.625
2,1,2019-01-03,-1,68.500,1.3,68.250,17.750
3,1,2019-01-04,2,77.250,0.0,7.625,18.125
4,1,2019-01-05,3,81.125,0.0,23.750,11.250

**Bikes**

In [8]:
tor_bikes.head()

   bike_id  location_id
0     1296            1
1     2947            1
2     2293            1
3      283            1
4     1799            1

In [9]:
van_bikes.head()

   bike_id  location_id
0    388.0            2
1   1880.0            2
2    779.0            2
3   2123.0            2
4    444.0            2

In [10]:
bos_bikes.head()

   bike_id  location_id
0     3689            3
1     4142            3
2     1628            3
3     2969            3
4     3469            3

In [11]:
nyc_bikes.head()

   bike_id  location_id
0    15839            4
1    32723            4
2    27451            4
3    21579            4
4    35379            4

**Member Types**

In [12]:
tor_users.head()

     member_type  location_id
0  Annual Member            1
1  Casual Member            1

In [13]:
van_users.head()

                 member_type  location_id
0               365 Standard            2
1                   365 Plus            2
2     Vancity Community Pass            2
3     365 Day Pass Plus SALE            2
4  365 Day Founding Standard            2

In [14]:
bos_users.head()

  member_type  location_id
0  Subscriber            3
1    Customer            3

In [15]:
nyc_users

  member_type  location_id
0  Subscriber            4
1    Customer            4

**Pricing Index**

**Ridership**

In [18]:
# Toronto

toronto.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

### Load data

In [16]:
cnx = f'postgresql://{conn_string}'
engine = create_engine(cnx)

In [17]:
# confirm tables
engine.table_names()

['locations',
 'membertypes',
 'stations',
 'bikes',
 'ridership',
 'pricing',
 'historicalweather']

In [ ]:
# load locations into database
df.to_sql(name='locations', con=engine, if_exists='append', index=True)

In [ ]:
# load stations into database
stns.to_sql(name='stations', con=engine, if_exists='append', index=False)

In [ ]:
# load historical weather into database
weather.to_sql(name='historicalweather', con=engine, if_exists='append', index=False)

In [ ]:
# load toronto bikes into database
tor_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load vancouver bikes into database
van_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load boston bikes into database
bos_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load new york bikes into database
nyc_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load toronto member types
tor_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load vancouver member types
van_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load boston member types
bos_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load new york member types
nyc_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

**Load Ridership**

In [57]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session

# check reference to stations table
# create session
session = Session(bind=engine)
# declare a base using automap_base
Base = automap_base()
# use the Base class to reflect the database tables
Base.prepare(engine, reflect=True)
Base.classes.keys()
Stations = Base.classes.stations

*Verify that all station_ids used in bikeshare exists in Stations table*

In [100]:
all_stations = session.query(Stations.station_id).all()
all_stns_df = pd.DataFrame(all_stations)
all_stns_df

      station_id
0           7000
1           7001
2           7002
3           7003
4           7004
...          ...
2396        4248
2397        4249
2398        4250
2399        4252
2400        4253

[2401 rows x 1 columns]

In [114]:
# get all unique start_station_ids
start_station = pd.DataFrame(toronto[["start_station_id"]])
start_stn = start_station
start_station = start_station.sort_values(by=['start_station_id'])
start_station = start_station.drop_duplicates().reset_index(drop=True)

In [92]:
start_station

     start_station_id
0                7000
1                7001
2                7002
3                7003
4                7004
..                ...
464              7506
465              7508
466              7509
467              7510
468              7511

[469 rows x 1 columns]

In [124]:
# get all unique end_station_ids
end_station = pd.DataFrame(toronto[["end_station_id"]])
end_stn = end_station
end_station = end_station.sort_values(by=['end_station_id'])
end_station = end_station.drop_duplicates().reset_index(drop=True)

In [97]:
end_station

     end_station_id
0            7000.0
1            7001.0
2            7002.0
3            7003.0
4            7004.0
..              ...
463          7506.0
464          7508.0
465          7509.0
466          7510.0
467          7511.0

[468 rows x 1 columns]

In [110]:
missing_start = start_station[-start_station["start_station_id"].isin(all_stns_df["station_id"])]
missing_start = missing_start.rename(columns={"start_station_id":"station_id"})
missing_start = missing_start.assign(location_id=1)

In [111]:
missing_start

     station_id  location_id
201        7218            1
202        7219            1
363        7393            1
364        7394            1
382        7416            1
468        7511            1

*Create all missing stations in stations table*

In [113]:
#missing_start.to_sql(name='stations', con=engine, if_exists='append', index=False)

In [100]:
all_stations = session.query(Stations.station_id).all()
all_stns_df = pd.DataFrame(all_stations)
all_stns_df

      station_id
0           7000
1           7001
2           7002
3           7003
4           7004
...          ...
2396        4248
2397        4249
2398        4250
2399        4252
2400        4253

[2401 rows x 1 columns]

In [115]:
missing_end = end_station[-end_station["end_station_id"].isin(all_stns_df["station_id"])]
missing_end = missing_end.rename(columns={"start_station_id":"station_id"})
missing_end = missing_end.assign(location_id=1)

In [116]:
missing_end

     end_station_id  location_id
201          7218.0            1
202          7219.0            1
363          7394.0            1
381          7416.0            1
467          7511.0            1

*Create all missing stations in stations table*

In [117]:
#missing_end.to_sql(name='stations', con=engine, if_exists='append', index=False)

*Verify if all stations exists*

In [118]:
all_stations = session.query(Stations.station_id).all()
all_stns_df = pd.DataFrame(all_stations)
all_stns_df

      station_id
0           7000
1           7001
2           7002
3           7003
4           7004
...          ...
2396        4248
2397        4249
2398        4250
2399        4252
2400        4253

[2401 rows x 1 columns]

In [119]:
missing_start = start_station[-start_station["start_station_id"].isin(all_stns_df["station_id"])]
missing_start

     start_station_id
201              7218
202              7219
363              7393
364              7394
382              7416
468              7511

In [120]:
missing_end = end_station[-end_station["end_station_id"].isin(all_stns_df["station_id"])]
missing_end

     end_station_id
201          7218.0
202          7219.0
363          7394.0
381          7416.0
467          7511.0

In [122]:
start_stn = start_stn.sort_values(by=["start_station_id"])
start_stn

         start_station_id
120902               7000
131100               7000
1290067              7000
1797085              7000
1797087              7000
...                   ...
2205648              7510
2016145              7510
1289284              7510
1329882              7510
1911869              7511

[2439063 rows x 1 columns]

In [125]:
end_stn = end_stn.sort_values(by=["end_station_id"])
end_stn

         end_station_id
1916983          7000.0
644859           7000.0
467394           7000.0
869201           7000.0
1297691          7000.0
...                 ...
1874293          7510.0
2360541          7510.0
1395184          7510.0
1973650          7510.0
1911869          7511.0

[2439063 rows x 1 columns]

In [139]:
#missing_start_stn = start_stn[-start_stn["start_station_id"].isin(all_stns_df["station_id"])]
exists_start_stn = start_stn[start_stn["start_station_id"].isin(all_stns_df["station_id"])]
exists_start_stn

         start_station_id
120902               7000
131100               7000
1290067              7000
1797085              7000
1797087              7000
...                   ...
2397696              7510
2205648              7510
2016145              7510
1289284              7510
1329882              7510

[2434344 rows x 1 columns]

In [126]:
missing_end_stn = end_stn[-end_stn["end_station_id"].isin(all_stns_df["station_id"])]
missing_end_stn

         end_station_id
744177           7218.0
745781           7218.0
991667           7218.0
992144           7218.0
992520           7218.0
...                 ...
1449016          7416.0
1872786          7416.0
1900541          7416.0
950105           7416.0
1911869          7511.0

[4366 rows x 1 columns]

**Drop rows with station_id missing from stations table**

In [141]:

toronto = toronto[toronto["start_station_id"].isin(all_stns_df["station_id"])]
toronto

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1
...,...,...,...,...,...,...,...,...
2439058,523,12/31/2019 23:39,12/31/2019 23:48,7098,7339.0,861,Annual Member,1
2439059,273,12/31/2019 23:45,12/31/2019 23:49,7044,7273.0,3776,Annual Member,1
2439060,1055,12/31/2019 23:51,01/01/2020 00:08,7100,7100.0,2382,Annual Member,1
2439061,459,12/31/2019 23:55,01/01/2020 00:03,7470,7102.0,2800,Annual Member,1
2439062,361,12/31/2019 23:58,01/01/2020 00:04,7168,7033.0,4139,Annual Member,1

In [137]:
missing_start_stn["start_station_id"]

994110     7218
994102     7218
1736519    7219
1736807    7219
1736161    7219
           ...
2012785    7416
1660803    7416
1714252    7416
2281931    7416
1911869    7511
Name: start_station_id, Length: 4719, dtype: int64